load-test.yml
config:
  target: "http://localhost:3000"
  phases:
    - duration: 120
      arrivalRate: 100 # 50 requêtes par seconde pendant 2 minutes secondes (500 requêtes total)
      name: "Ouverture de la billetterie"

scenarios:
  - name: "Achat d'un billet"
    flow:
      - post:
          url: "/buy-ticket/1"
          json:
            userId: 1
            quantity: 3